m-okada/QV08/emu/ARM/kinetis_workspace/mk22f/drivers/fsl_smartcard_uart.c
#if defined(FSL_FEATURE_SOC_PIT_COUNT) && (FSL_FEATURE_SOC_PIT_COUNT)
/*!
 * @brief Function un-gates peripheral clock of PIT0.
 */
static void smartcard_uart_TimerInit(uint8_t channel)
{
    /* Un-gate the PIT timer clock*/
    CLOCK_EnableClock(kCLOCK_Pit0);
    /* enable timers clock */
    PIT->MCR &= ~PIT_MCR_MDIS_MASK;
    /* Set timer period to zero */
    PIT->CHANNEL[channel].LDVAL = 0u;
    /* Stop timer and disable interrupt if it's not */
    PIT->CHANNEL[channel].TCTRL = 0u;
    /* Enable timer interrupt to occur */
    NVIC_EnableIRQ(PIT0_IRQn);
}

/*!
 * @brief Function gates peripheral clock of PIT0.
 */
static void smartcard_uart_TimerDeinit(void)
{
    /* Gate the PIT timer clock*/
    CLOCK_DisableClock(kCLOCK_Pit0);
    /* Disable pit IRQ interrupt to occur */
    NVIC_DisableIRQ(PIT0_IRQn);
}

/*!
 * @brief Initializes timer specific channel with input period, enable channel interrupt and start counter.
 */
void smartcard_uart_TimerStart(uint8_t channel, uint32_t time)
{
    /* Set timer period */
    PIT->CHANNEL[channel].LDVAL = time;
    /* Enable timer channel interrupt and timer */
    PIT->CHANNEL[channel].TCTRL = PIT_TCTRL_TIE_MASK | PIT_TCTRL_TEN_MASK;
}

/*!
 * @brief Stop timer specific channel, disable channel interrupts and stops counter.
 */
static void smartcard_uart_TimerStop(uint8_t channel)
{
    /* Stop timer if it's not and disable timer channel interrupt*/
    PIT->CHANNEL[channel].TCTRL &= ~(PIT_TCTRL_TEN_MASK | PIT_TCTRL_TIE_MASK);
}
#endif /* FSL_FEATURE_SOC_PIT_COUNT */

void SMARTCARD_UART_GetDefaultConfig(smartcard_card_params_t *cardParams)
{
    /* EMV default values */
    cardParams->Fi = 372u;
    cardParams->Di = 1u;
    cardParams->currentD = 1u;
    cardParams->WI = 0x0Au;
    cardParams->GTN = 0x00u;
}

status_t SMARTCARD_UART_Init(UART_Type *base, smartcard_context_t *context, uint32_t srcClock_Hz)
{
    assert((NULL != base));

    if ((NULL == context) || (srcClock_Hz == 0u))
    {
        return kStatus_SMARTCARD_InvalidInput;
    }

    IRQn_Type uart_irqs[] = UART_RX_TX_IRQS;
    IRQn_Type uartError_irqs[] = UART_ERR_IRQS;
    uint32_t instance = 0u;

    context->base = base;
    /* Enable peripheral clock */
    CLOCK_EnableClock(s_uartClock[smartcard_uart_GetInstance(base)]);
    /* Initialize UART to a known context. */
    base->BDH = 0u;
    base->BDL = 0u;
    base->C1 = 0u;
    base->C2 = 0u;
    base->S2 = 0u;
    base->C3 = 0u;
#if defined(FSL_FEATURE_UART_HAS_ADDRESS_MATCHING) && (FSL_FEATURE_UART_HAS_ADDRESS_MATCHING)
    base->MA1 = 0u;
    base->MA2 = 0u;
#endif
    base->C4 = 0u;
#if defined(FSL_FEATURE_UART_HAS_DMA_ENABLE) && (FSL_FEATURE_UART_HAS_DMA_ENABLE)
    base->C5 = 0u;
#endif
#if defined(FSL_FEATURE_UART_HAS_MODEM_SUPPORT) && (FSL_FEATURE_UART_HAS_MODEM_SUPPORT)
    base->MODEM = 0u;
#endif
#if defined(FSL_FEATURE_UART_HAS_IR_SUPPORT) && (FSL_FEATURE_UART_HAS_IR_SUPPORT)
    base->IR = 0u;
#endif
#if defined(FSL_FEATURE_UART_HAS_FIFO) && (FSL_FEATURE_UART_HAS_FIFO)
    base->PFIFO = 0u;
    base->CFIFO = 0u;
    base->SFIFO = 0xC0u;
    base->TWFIFO = 0u;
    base->RWFIFO = 1u;
#endif
    /* Initialize UART module for SMARTCARD mode of default operation */
    smartcard_uart_SetTransferType(base, context, kSMARTCARD_SetupATRMode);
#if defined(FSL_FEATURE_UART_HAS_FIFO) && (FSL_FEATURE_UART_HAS_FIFO)
    /* Flush FIFO contents */
    base->CFIFO |= ((1u << UART_CFIFO_TXFLUSH_SHIFT) | (1u << UART_CFIFO_RXFLUSH_SHIFT));
#endif
    /* For modules that do not support a FIFO, they have a data buffer that
    * essentially acts likes a one-entry FIFO, thus to make the code cleaner,
    * we'll equate txFifoEntryCount to 1. Also note that TDRE flag will set
    * only when the tx buffer is empty. */
    context->txFifoEntryCount = 1u;
#if defined(FSL_FEATURE_PIT_TIMER_COUNT) && (FSL_FEATURE_PIT_TIMER_COUNT)
    /* Initialize HW timer for the initial character (TS) delay measurement */
    smartcard_uart_TimerInit(context->interfaceConfig.tsTimerId);
#endif
    /* Enable UART interrupt on NVIC level. */
    instance = smartcard_uart_GetInstance(base);
    NVIC_EnableIRQ(uart_irqs[instance]);
    NVIC_EnableIRQ(uartError_irqs[instance]);
    /* Finally, disable the UART receiver and transmitter */
    base->C2 &= ~(UART_C2_TE_MASK | UART_C2_RE_MASK);

    return kStatus_SMARTCARD_Success;
}

void SMARTCARD_UART_Deinit(UART_Type *base)
{
    assert(NULL != base);

    uint32_t instance = 0u;
    IRQn_Type uart_irqs[] = UART_RX_TX_IRQS;
    IRQn_Type uartError_irqs[] = UART_ERR_IRQS;
    /* In case there is still data in the TX FIFO or shift register that is
    * being transmitted wait till transmit is complete.
    * Wait until the data is completely shifted out of shift register */
    while (0u == ((base->S1 & UART_S1_TC_MASK) >> UART_S1_TC_SHIFT))
    {
    }

    base->C2 &= ~UART_C2_TIE_MASK;
#if defined(FSL_FEATURE_UART_IS_SCI) && (FSL_FEATURE_UART_IS_SCI)
    base->C4 &= ~UART_C4_TDMAS_MASK;
#else
    base->C5 &= ~UART_C5_TDMAS_MASK;
#endif
    base->C2 &= ~UART_C2_RIE_MASK;
#if defined(FSL_FEATURE_UART_IS_SCI) && (FSL_FEATURE_UART_IS_SCI)
    base->C4 &= ~UART_C4_RDMAS_MASK;
#else
    base->C5 &= ~UART_C5_RDMAS_MASK;
#endif
    /* Disable TX and RX */
    base->C2 &= (~UART_C2_TE_MASK & ~UART_C2_RE_MASK);
#if defined(FSL_FEATURE_UART_HAS_FIFO) && (FSL_FEATURE_UART_HAS_FIFO)
    /* Flush FIFO contents */
    base->CFIFO |= ((1u << UART_CFIFO_TXFLUSH_SHIFT) | (1u << UART_CFIFO_RXFLUSH_SHIFT));
#endif
    /* Disable UART module clock */
    CLOCK_DisableClock(s_uartClock[smartcard_uart_GetInstance(base)]);
    /* Disable the interrupt */
    instance = smartcard_uart_GetInstance(base);
    NVIC_DisableIRQ(uart_irqs[instance]);
    NVIC_DisableIRQ(uartError_irqs[instance]);
/* De-initialize also external PIT timer */
#if defined(FSL_FEATURE_PIT_TIMER_COUNT) && (FSL_FEATURE_PIT_TIMER_COUNT)
    smartcard_uart_TimerDeinit();
#endif
}

