m-okada/QV08/emu/ARM/kinetis_workspace/mk22f/drivers/fsl_smartcard_uart.c
int32_t SMARTCARD_UART_GetTransferRemainingBytes(UART_Type *base, smartcard_context_t *context)
{
    if ((NULL == context))
    {
        return -1;
    }

    /* Return kStatus_UART_TxBusy or kStatus_UART_Success depending on whether
     * or not the UART has a FIFO. If it does have a FIFO, we'll need to wait
     * until the FIFO is completely drained before indicating success in
     * addition to isTxBusy = 0. If there is no FIFO, then we need to only worry
     * about isTxBusy. */
    if (context->xIsBusy)
    {
        return context->xSize;
    }

    return 0;
}

status_t SMARTCARD_UART_AbortTransfer(UART_Type *base, smartcard_context_t *context)
{
    if ((NULL == context))
    {
        return kStatus_SMARTCARD_InvalidInput;
    }

    /* Check if a transfer is running. */
    if ((!context->xIsBusy))
    {
        return kStatus_SMARTCARD_NoTransferInProgress;
    }
    /* Call transfer complete to abort transfer */
    if (kSMARTCARD_Receive == context->direction)
    { /* Stop the running transfer. */
        smartcard_uart_CompleteReceiveData(base, context);
    }
    else if (kSMARTCARD_Transmit == context->direction)
    { /* Stop the running transfer. */
        smartcard_uart_CompleteSendData(base, context);
    }
    else
    {
        return kStatus_SMARTCARD_InvalidInput;
    }

    return kStatus_SMARTCARD_Success;
}

status_t SMARTCARD_UART_TransferNonBlocking(UART_Type *base, smartcard_context_t *context, smartcard_xfer_t *xfer)
{
    if ((NULL == context) || (NULL == xfer) || (NULL == xfer->buff))
    {
        return kStatus_SMARTCARD_InvalidInput;
    }

    /* Check input parameters */
    if ((0u == xfer->size))
    {
        return kStatus_SMARTCARD_Success;
    }
    /* Check if some transfer is in progress */
    if (0u != SMARTCARD_UART_GetTransferRemainingBytes(base, context))
    {
        if (kSMARTCARD_Receive == context->direction)
        {
            return kStatus_SMARTCARD_RxBusy;
        }
        else
        {
            return kStatus_SMARTCARD_TxBusy;
        }
    }
    /* Initialize error check flags */
    context->rxtCrossed = false;
    context->txtCrossed = false;
    context->parityError = false;
    /* Initialize SMARTCARD context structure to start transfer */
    context->xBuff = xfer->buff;
    context->xSize = xfer->size;

    if (kSMARTCARD_Receive == xfer->direction)
    {
        context->direction = xfer->direction;
        context->transferState = kSMARTCARD_ReceivingState;
        /* Start transfer */
        smartcard_uart_StartReceiveData(base, context);
    }
    else if (kSMARTCARD_Transmit == xfer->direction)
    {
        context->direction = xfer->direction;
        context->transferState = kSMARTCARD_TransmittingState;
        /* Start transfer */
        smartcard_uart_StartSendData(base, context);
    }
    else
    {
        return kStatus_SMARTCARD_InvalidInput;
    }

    return kStatus_SMARTCARD_Success;
}

void SMARTCARD_UART_ErrIRQHandler(UART_Type *base, smartcard_context_t *context)
{
    if ((NULL == context))
    {
        return;
    }

    /* Check if a parity error occurred */
    if (base->S1 & UART_S1_PF_MASK)
    {
        if (kSMARTCARD_WaitingForTSState == context->transferState)
        {
            /* A parity error detected during initial character (TS) detection phase */
            context->transferState = kSMARTCARD_InvalidTSDetecetedState;
            /* Un-block any caller waiting for initial character detection */
            if ((context->xIsBusy) && (context->direction == kSMARTCARD_Receive))
            {
                smartcard_uart_CompleteReceiveData(base, context);
            }
        }
        else
        { /* Parity error detected after initial character detection phase */
            context->parityError = true;
        }
    }
    /* Check if Transmission threshold value was exceeded */
    if (base->IS7816 & UART_IS7816_TXT_MASK)
    { /* Disable transmitter */
        base->C2 &= ~UART_C2_TE_MASK;
        /* Clear Transmission threshold interrupt flag */
        base->IS7816 = UART_IS7816_TXT_MASK;
        /* Enable transmitter */
        base->C2 |= UART_C2_TE_MASK;
        context->txtCrossed = true;
    }
    /* Check if Receiver threshold value was exceeded */
    if (base->IS7816 & UART_IS7816_RXT_MASK)
    {
        /* Clear Receiver threshold interrupt flag */
        base->IS7816 = UART_IS7816_RXT_MASK;
        /* Check if Receiver threshold was exceeded during initial character detection */
        if (kSMARTCARD_WaitingForTSState == context->transferState)
        {
            context->transferState = kSMARTCARD_InvalidTSDetecetedState;
            if ((context->xIsBusy) && (context->direction == kSMARTCARD_Receive))
            {
                smartcard_uart_CompleteReceiveData(base, context);
            }
        }
        else
        { /* Receiver threshold exceeded during normal transfer, set flags */
            context->rxtCrossed = true;
        }
    }
    /* Check if a Guard Timer rule was violated */
    if (base->IS7816 & UART_IS7816_GTV_MASK)
    { /* Clear respective interrupt status flag */
        base->IS7816 = UART_IS7816_GTV_MASK;
    }
    /* Check if a Work Wait Timer expired */
    if (base->IS7816 & UART_IS7816_WT_MASK)
    { /* Reset WWT timer */
        SMARTCARD_UART_Control(base, context, kSMARTCARD_ResetWWT, 0);
        /* Indicate WWT expired */
        context->timersState.wwtExpired = true;

        if (context->xIsBusy)
        {
            if (kSMARTCARD_Receive == context->direction)
            { /* Terminate and un-block any caller */
                smartcard_uart_CompleteReceiveData(base, context);
            }
            else
            { /* Terminate and un-block any caller */
                smartcard_uart_CompleteSendData(base, context);
            }
        }
    }
    /* Check if a Character Wait Timer expired */
    if (base->IS7816 & UART_IS7816_CWT_MASK)
    { /* Disable Character Wait Timer interrupt */
        base->IE7816 &= ~UART_IE7816_CWTE_MASK;
        /* Reset CWT timer otherwise this interrupt keeps coming */
        SMARTCARD_UART_Control(base, context, kSMARTCARD_ResetCWT, 0);
        /* Change transfer context to Idle */
        context->transferState = kSMARTCARD_IdleState;
        /* Indicate CWT expired */
        context->timersState.cwtExpired = true;

        if (context->xIsBusy)
        {
            if (kSMARTCARD_Receive == context->direction)
            { /* Terminate and un-block any caller */
                smartcard_uart_CompleteReceiveData(base, context);
            }
            else
            { /* Terminate and un-block any caller */
                smartcard_uart_CompleteSendData(base, context);
            }
        }
    }
    /* Check if a Block Wait Timer expired */
    if (base->IS7816 & UART_IS7816_BWT_MASK)
    { /* Disable Block Wait Timer interrupt */
        base->IE7816 &= ~UART_IE7816_BWTE_MASK;
        /* Reset BWT timer */
        SMARTCARD_UART_Control(base, context, kSMARTCARD_ResetBWT, 0);
        /* Indicate BWT expired */
        context->timersState.bwtExpired = true;
        /* Check if Wait Time Extension was requested */
        if (context->wtxRequested)
        {
            SMARTCARD_UART_Control(base, context, kSMARTCARD_ResetWaitTimeMultiplier, 0);
        }
        if (context->xIsBusy)
        {
            if (kSMARTCARD_Receive == context->direction)
            { /* Terminate and un-block any caller */
                smartcard_uart_CompleteReceiveData(base, context);
            }
            else
            { /* Terminate and un-block any caller */
                smartcard_uart_CompleteSendData(base, context);
            }
        }
    }
#if defined(FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT) && (FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT)
    /* Check if a ATR duration timer Wait Timer expired */
    if ((base->IE7816 & UART_IE7816_ADTE_MASK) && (base->IS7816 & UART_IS7816_ADT_MASK))
    { /* Clear ATR Duration Timer interrupt flag */
        base->IS7816 = UART_IS7816_ADT_MASK;
        /* Indicate ADT expired */
        context->timersState.adtExpired = true;
    }
#endif
    /* Clear pending interrupts */
    (void)base->S1;
    (void)base->D;
}

void SMARTCARD_UART_IRQHandler(UART_Type *base, smartcard_context_t *context)
{
    if ((NULL == context))
    {
        return;
    }

    /* Check if Initial Character (TS) was detected */
    if (base->IS7816 & UART_IS7816_INITD_MASK)
    {
#if defined(FSL_FEATURE_PIT_TIMER_COUNT) && (FSL_FEATURE_PIT_TIMER_COUNT)
        /* Stop TS timer */
        smartcard_uart_TimerStop(context->interfaceConfig.tsTimerId);
#endif
        /* Get Data Convention format from RXINV bit in UART_S2 register */
        context->cardParams.convention = (smartcard_card_convention_t)(base->S2 & UART_S2_RXINV_MASK);
        /* Clear interrupt flag for initial character detected */
        base->IS7816 = UART_IS7816_INITD_MASK;
        /* Disable initial character detection */
        base->IE7816 &= ~UART_IE7816_INITDE_MASK;
        /* Set transfer mode to receiving(ATR bytes) mode */
        context->transferState = kSMARTCARD_ReceivingState;
        /* Complete receive process */
        smartcard_uart_CompleteReceiveData(base, context);
        return;
    }
    /* Exit the ISR if no transfer is happening for this instance. */
    if ((!context->xIsBusy))
    {
        assert(0);
        return;
    }
    /* Handle receive data register full interrupt, if RX data register full
     * interrupt is enabled AND there is data available. */
    if ((base->C2 & UART_C2_RIE_MASK) && (base->S1 & UART_S1_RDRF_MASK))
    { /* Get data and put into receive buffer */
        *(context->xBuff) = base->D;
        ++context->xBuff;
        --context->xSize;

        if ((context->tType == kSMARTCARD_T1Transport) && (context->xSize > 0u) &&
            (base->IE7816 & UART_IE7816_BWTE_MASK))
        {
            /* Only the 1st byte has been received, now time to disable BWT interrupt
             * and enable CWT interrupt */
            base->IE7816 = (base->IE7816 & ~UART_IE7816_BWTE_MASK) | UART_IE7816_CWTE_MASK;
            context->timersState.cwtExpired = false;
        }
        /* Check and see if this was the last byte received */
        if (0u == context->xSize)
        {
            smartcard_uart_CompleteReceiveData(base, context);
        }
    }
    /* Handle transmit data register empty interrupt and
     * last data was shifted out of IO line */
    if ((base->C2 & UART_C2_TE_MASK) && (base->S1 & (UART_S1_TDRE_MASK | UART_S1_TC_MASK)))
    {
        if (context->txtCrossed)
        { /* Un-block the caller */
            smartcard_uart_CompleteSendData(base, context);
            return;
        }
        /* Check to see if there are any more bytes to send */
        if (context->xSize)
        {
            uint8_t emptyEntryCountInFifo = context->txFifoEntryCount;

            while (emptyEntryCountInFifo--)
            { /* Transmit data and update tx size/buff */
                base->D = *(context->xBuff);
                ++context->xBuff;
                --context->xSize;
                if (!context->xSize)
                {
                    smartcard_uart_CompleteSendData(base, context);
                    break;
                }
            }
        }
    }
}

status_t SMARTCARD_UART_Control(UART_Type *base,
                                smartcard_context_t *context,
                                smartcard_control_t control,
                                uint32_t param)
{
    if ((NULL == context))
    {
        return kStatus_SMARTCARD_InvalidInput;
    }

    uint32_t uartModuleClock;
    uint32_t instance;
    uint8_t temp;
    uint32_t brfa, sbr;
    uint32_t sourceClockInKHz = 0u;
    uint32_t sCClockInKHz = 0u;

    switch (control)
    {
        case kSMARTCARD_EnableADT:
#if defined(FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT) && (FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT)
            /* Disable ISO-7816 mode first */
            base->C7816 &= ~UART_C7816_ISO_7816E_MASK;
            /* Set ATR timer value */
            base->AP7816A_T0 = (uint8_t)(SMARTCARD_EMV_ATR_DURATION_ETU >> 8);
            base->AP7816B_T0 = (uint8_t)(SMARTCARD_EMV_ATR_DURATION_ETU);
            /* Enable ATR specific interrupt */
            base->IE7816 |= UART_IE7816_ADTE_MASK;
            /* Enable ISO-7816 mode */
            base->C7816 |= UART_C7816_ISO_7816E_MASK;
#endif
            break;
        case kSMARTCARD_DisableADT:
#if defined(FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT) && (FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT)
            /* Disable ATR specific interrupt */
            base->IE7816 &= ~UART_IE7816_ADTE_MASK;
            /* Clear ATR timer value */
            base->AP7816A_T0 = 0u;
            base->AP7816B_T0 = 0u;
#endif
            break;
        case kSMARTCARD_EnableGTV:
            /* Enable GTV specific interrupt */
            base->IE7816 |= UART_IE7816_GTVE_MASK;
            break;
        case kSMARTCARD_DisableGTV:
            /* Disable GTV specific interrupt */
            base->IE7816 &= ~UART_IE7816_GTVE_MASK;
            break;
        case kSMARTCARD_ResetWWT:
            /* save the current value of IE7816 register */
            temp = base->IE7816;
            /* disable 7816 function */
            base->C7816 &= ~UART_C7816_ISO_7816E_MASK;
            /* clear any pending WT interrupt flag */
            base->IS7816 = UART_IS7816_WT_MASK;
            /* enable 7816 function */
            base->C7816 |= UART_C7816_ISO_7816E_MASK;
            /* re-enable all interrupts */
            base->IE7816 = temp;
            break;
        case kSMARTCARD_EnableWWT:
            /* Enable WWT Timer interrupt to occur */
            base->IE7816 |= UART_IE7816_WTE_MASK;
            break;
        case kSMARTCARD_DisableWWT:
            /* Disable WWT Timer interrupt to occur */
            base->IE7816 &= ~UART_IE7816_WTE_MASK;
            break;
        case kSMARTCARD_ResetCWT:
            /* Reset CWT Timer */
            /* Save interrupts configuration */
            temp = base->IE7816;
            /* disable 7816 function */
            base->C7816 &= ~UART_C7816_ISO_7816E_MASK;
            /* Clear Character Wait Timer interrupt flag */
            base->IS7816 = UART_IS7816_CWT_MASK;
            /* enable 7816 function */
            base->C7816 |= UART_C7816_ISO_7816E_MASK;
            /* re-enable all interrupts */
            base->IE7816 = temp;
            break;
        case kSMARTCARD_EnableCWT:
            /* Enable CWT Timer interrupt to occur */
            base->IE7816 |= UART_IE7816_CWTE_MASK;
            break;
        case kSMARTCARD_DisableCWT:
            /* Disable WWT Timer interrupt to occur */
            base->IE7816 &= ~UART_IE7816_CWTE_MASK;
            break;
        case kSMARTCARD_ResetBWT:
            /* Reset BWT timer */
            /* Save interrupts configuration */
            temp = base->IE7816;
            /* disable 7816 function */
            base->C7816 &= ~UART_C7816_ISO_7816E_MASK;
            /* Clear Block Wait Timer interrupt flag */
            base->IS7816 = UART_IS7816_BWT_MASK;
            /* enable 7816 function */
            base->C7816 |= UART_C7816_ISO_7816E_MASK;
            /* re-enable all interrupts */
            base->IE7816 = temp;
            break;
        case kSMARTCARD_EnableBWT:
            /* Enable BWT Timer interrupt to occur */
            base->IE7816 |= UART_IE7816_BWTE_MASK;
            break;
        case kSMARTCARD_DisableBWT:
            /* Disable BWT Timer interrupt to occur */
            base->IE7816 &= ~UART_IE7816_BWTE_MASK;
            break;
        case kSMARTCARD_EnableInitDetect:
            /* Clear all ISO7816 interrupt flags */
            base->IS7816 = 0xFFu;
            /* Enable initial character detection */
            base->C7816 |= UART_C7816_INIT_MASK;
            /* Check and clear any pending initial character detected flag */
            base->IS7816 = UART_IS7816_INITD_MASK;
            /* Enable TS detect interrupt*/
            base->IE7816 |= UART_IE7816_INITDE_MASK;
            break;
        case kSMARTCARD_EnableAnack:
            /* Enable NACK-on-error interrupt to occur */
            base->C7816 |= UART_C7816_ANACK_MASK;
            break;
        case kSMARTCARD_DisableAnack:
            /* Disable NACK-on-error interrupt to occur */
            base->C7816 &= ~UART_C7816_ANACK_MASK;
            break;
        case kSMARTCARD_ConfigureBaudrate:
            instance = smartcard_uart_GetInstance(base);
            /* Get UART module clock from system clock module */
            switch (instance)
            {
                case 0u:
#if defined(UART0_CLK_SRC)
                    uartModuleClock = CLOCK_GetFreq(UART0_CLK_SRC);
#else
                    uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
                    break;
                case 1u:
#if defined(UART1_CLK_SRC)
                    uartModuleClock = CLOCK_GetFreq(UART1_CLK_SRC);
#else
                    uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
                    break;
#if (FSL_FEATURE_SOC_UART_COUNT >= 3)
                case 2u:
#if defined(UART2_CLK_SRC)
                    uartModuleClock = CLOCK_GetFreq(UART2_CLK_SRC);
#else
                    uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
                    break;
#endif
#if (FSL_FEATURE_SOC_UART_COUNT >= 4)
                case 3u:
#if defined(UART3_CLK_SRC)
                    uartModuleClock = CLOCK_GetFreq(UART3_CLK_SRC);
#else
                    uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
                    break;
#endif
#if (FSL_FEATURE_SOC_UART_COUNT >= 5)
                case 4u:
#if defined(UART4_CLK_SRC)
                    uartModuleClock = CLOCK_GetFreq(UART4_CLK_SRC);
#else
                    uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
                    break;
#endif
#if (FSL_FEATURE_SOC_UART_COUNT >= 6)
                case 5u:
#if defined(UART5_CLK_SRC)
                    uartModuleClock = CLOCK_GetFreq(UART5_CLK_SRC);
#else
                    uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
                    break;
#endif
                default:
                    uartModuleClock = 0u;
                    break;
            }
            sourceClockInKHz = uartModuleClock / 1000u;
            sCClockInKHz = context->interfaceConfig.smartCardClock / 1000u;
            /* BaudRate = (SourceClkInHz)/[16 * (SBR +  BRFA)] */
            sbr = (uint16_t)(sourceClockInKHz * context->cardParams.Fi /
                             (context->cardParams.currentD * sCClockInKHz * 16u));
            /* check to see if sbr is out of range of register bits */
            if ((sbr > 0x1FFFu) || (sbr < 1u))
            { /* unsupported baud rate for given source clock input*/
                return kStatus_SMARTCARD_OtherError;
            }
            temp = base->BDH & ~UART_BDH_SBR_MASK;
            base->BDH = temp | (uint8_t)(sbr >> 8u);
            base->BDL = (uint8_t)sbr;
#if defined(FSL_FEATURE_UART_HAS_BAUD_RATE_FINE_ADJUST_SUPPORT) && (FSL_FEATURE_UART_HAS_BAUD_RATE_FINE_ADJUST_SUPPORT)
            /* determine if a fractional divider is needed to fine tune closer to the
            * desired baud, each value of brfa is in 1/32 increments,
            * hence the multiply-by-32. */
            brfa =
                (32u * sourceClockInKHz * context->cardParams.Fi) / (context->cardParams.currentD * sCClockInKHz * 16u);
            brfa -= (uint16_t)(32u * sbr);
            /* write the brfa value to the register*/
            temp = base->C4 & ~UART_C4_BRFA_MASK;
            base->C4 = temp | brfa;
#endif
            break;
        case kSMARTCARD_SetupATRMode:
            /* Set in default ATR mode */
            smartcard_uart_SetTransferType(base, context, kSMARTCARD_SetupATRMode);
            break;
        case kSMARTCARD_SetupT0Mode:
            /* Set transport protocol type to T=0 */
            smartcard_uart_SetTransferType(base, context, kSMARTCARD_SetupT0Mode);
            break;
        case kSMARTCARD_SetupT1Mode:
            /* Set transport protocol type to T=1 */
            smartcard_uart_SetTransferType(base, context, kSMARTCARD_SetupT1Mode);
            break;
        case kSMARTCARD_EnableReceiverMode:
            /* Enable receiver mode and switch to receive direction */
            base->C2 |= UART_C2_RE_MASK;
            base->C3 &= ~UART_C3_TXDIR_MASK;
            break;
        case kSMARTCARD_DisableReceiverMode:
            /* Disable receiver */
            base->C2 &= ~UART_C2_RE_MASK;
            break;
        case kSMARTCARD_EnableTransmitterMode:
            /* Enable transmitter mode and switch to transmit direction */
            base->C2 |= UART_C2_TE_MASK;
            base->C3 |= UART_C3_TXDIR_MASK;
            break;
        case kSMARTCARD_DisableTransmitterMode:
            /* Disable transmitter */
            base->C2 &= ~UART_C2_TE_MASK;
            break;
        case kSMARTCARD_ResetWaitTimeMultiplier:
#if defined(FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT) && (FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT)
            /* Reset Wait Timer Multiplier */
            /* Save interrupts configuration */
            temp = base->IE7816;
            /* Disable ISO7816 functionality */
            base->C7816 &= ~UART_C7816_ISO_7816E_MASK;
            /* Setting of the Wait Parameter Register */
            base->WP7816 = (uint8_t)(param);
            /* enable 7816 functionality */
            base->C7816 |= UART_C7816_ISO_7816E_MASK;
            /* Restore interrupts configuration */
            base->IE7816 = temp;
            /* Set flag to SMARTCARD context accordingly */
            if ((uint8_t)param == 0u)
            {
                context->wtxRequested = false;
            }
            else
            {
                context->wtxRequested = true;
            }
#endif
            break;
        default:
            return kStatus_SMARTCARD_InvalidInput;
    }

    return kStatus_SMARTCARD_Success;
}

void SMARTCARD_UART_TSExpiryCallback(UART_Type *base, smartcard_context_t *context)
{
    if ((NULL == context))
    {
        return;
    }
#if defined(FSL_FEATURE_SOC_PIT_COUNT) && FSL_FEATURE_SOC_PIT_COUNT
    /* Clear PIT timer interrupt status flag */
    PIT->CHANNEL[context->interfaceConfig.tsTimerId].TFLG = PIT_TFLG_TIF_MASK;
#endif /* FSL_FEATURE_SOC_PIT_COUNT */
    /* Set timer has expired */
    context->timersState.initCharTimerExpired = true;
    /* Stop TS timer */
    smartcard_uart_TimerStop(context->interfaceConfig.tsTimerId);
    context->transferState = kSMARTCARD_IdleState;
    /* Un-block the caller */
    smartcard_uart_CompleteReceiveData(base, context);

    return;
}
